
create_clock-period 30 -name clock_100 [get_ports clock]

create_clock -period 30.000 -name virtual_clock
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ealu_ctrl[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ealu_ctrl[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[0]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[1]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[1]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[2]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[2]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[3]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[3]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[4]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[4]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[5]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[5]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[6]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[6]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[7]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[7]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[8]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[8]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[9]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[9]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[10]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[10]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[11]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[11]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[12]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[12]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[13]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[13]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[14]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[14]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[15]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[15]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[16]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[16]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[17]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[17]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[18]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[18]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[19]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[19]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[20]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[20]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[21]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[21]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[22]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[22]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[23]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[23]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[24]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[24]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[25]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[25]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[26]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[26]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[27]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[27]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[28]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[28]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[29]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[29]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[30]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[30]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.500 [get_ports {alu_out[31]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {alu_out[31]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ealu_ctrl[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ealu_ctrl[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ealu_ctrl[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ealu_ctrl[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ealu_ctrl[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ealu_ctrl[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[0]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[4]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[4]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[5]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[5]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[6]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[6]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[7]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[7]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[8]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[8]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[9]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[9]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[10]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[10]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[11]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[11]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[12]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[12]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[13]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[13]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[14]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[14]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[15]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[15]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[16]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[16]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[17]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[17]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[18]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[18]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[19]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[19]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[20]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[20]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[21]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[21]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[22]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[22]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[23]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[23]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[24]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[24]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[25]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[25]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[26]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[26]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[27]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[27]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[28]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[28]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[29]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[29]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[30]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[30]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {erd_a[31]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {erd_a[31]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[0]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[4]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[4]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[5]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[5]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[6]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[6]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[7]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[7]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[8]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[8]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[9]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[9]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[10]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[10]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[11]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[11]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[12]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[12]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[13]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[13]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[14]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[14]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[15]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[15]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[16]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[16]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[17]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[17]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[18]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[18]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[19]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[19]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[20]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[20]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[21]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[21]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[22]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[22]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[23]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[23]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[24]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[24]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[25]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[25]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[26]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[26]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[27]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[27]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[28]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[28]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[29]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[29]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[30]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[30]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {ex_mux_out[31]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 2.000 [get_ports {ex_mux_out[31]}]
